In [1]:
from sqlalchemy import create_engine

In [ ]:
## 1.Establish a connection between Python and the Sakila database.

In [3]:
import getpass  # Para obtener la contraseña sin mostrar la entrada
password = getpass.getpass("Por favor, introduce la contraseña de la base de datos SQL: ")
str_conn = f"mysql+pymysql://root:{password}@127.0.0.1:3306/sakila"
cursor = create_engine(str_conn)

In [4]:
## 2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

In [5]:
import pandas as pd 

df_sakila = pd.read_sql("""select * from rental""", cursor)

df_sakila.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [6]:
from sqlalchemy import text

In [7]:
from sqlalchemy import text

def rental_month(cursor, month, year):
    query = text("""
    SELECT * ,
        DATE_FORMAT(CONVERT(sakila.rental.rental_date, DATE), '%m') as 'month',
        DATE_FORMAT(CONVERT(sakila.rental.rental_date, DATE), '%Y') as 'year'
    FROM rental
    WHERE
        DATE_FORMAT(CONVERT(sakila.rental.rental_date, DATE), '%m') = :month AND
        DATE_FORMAT(CONVERT(sakila.rental.rental_date, DATE), '%Y') = :year ;
    """)
    rental_data = pd.read_sql(query.bindparams(month=month, year=year), cursor)
    return rental_data

In [8]:
rental_datas = rental_month(cursor, "06", "2005")
rental_datas.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,year
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53,06,2005
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53,06,2005
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53,06,2005
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53,06,2005
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53,06,2005

In [9]:
## 3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

In [10]:
def rental_count_month(df, month, year):
    rentals = df.groupby('customer_id').size().reset_index(name=f'rentals_{month}_{year}')
    return rentals

In [11]:
rentals_month = rental_count_month(rental_datas, 5, 2005)
rentals_month.head()

   customer_id  rentals_5_2005
0            1               7
1            2               1
2            3               4
3            4               6
4            5               5

In [12]:
## 4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [ ]:
## crear dos df

In [13]:
rentals_month = rental_count_month(rental_datas, 6, 2005)
rentals_month2 = rental_count_month(rental_datas, 7, 2005)

In [14]:
rental_datas = rental_month(cursor, "06", "2005")
rental_datas2 = rental_month(cursor, "07", "2005")

In [ ]:
## funcion para comparar dos data frames

In [20]:
def compare_rentals(data1, data2):
    merged = pd.merge(data1, data2, on = "customer_id", how = "outer")
    merged['difference'] = merged ['rentals_5_2005'] - merged ["rentals_7_2005"]
    return merged

In [21]:
rentals1 = rental_count_month(rental_datas, 5, 2005)
rentals2 = rental_count_month(rental_datas2, 7, 2005)
compare = compare_rentals(rentals1, rentals2)
compare.head()

   customer_id  rentals_5_2005  rentals_7_2005  difference
0            1             7.0              12        -5.0
1            2             1.0              14       -13.0
2            3             4.0              13        -9.0
3            4             6.0               5         1.0
4            5             5.0              16       -11.0